Repository: MohamedMohamady125/HFATEST
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: HFA Swimming Club
ar: نادي HFA للسباحة

source: Home
ar: الرئيسية

source: Threads
ar: المحادثات

source: Gear
ar: الأدوات

source: Profile
ar: الملف الشخصي

# welcome
source: Welcome {name}
ar: مرحباً {name}

source: Coach Dashboard
ar: لوحة تحكم المدرب

source: Loading Dashboard...
ar: جارٍ تحميل لوحة التحكم...

source: Failed to load profile
ar: فشل تحميل الملف الشخصي

source: Failed to load profile data
ar: فشل تحميل بيانات الملف الشخصي

source: Registration Requests
ar: طلبات التسجيل

source: Attendance
ar: الحضور

source: Weekly Attendance
ar: الحضور الأسبوعي

source: Attendance Calendar
ar: تقويم الحضور

source: Monthly Attendance Calendar
ar: تقويم الحضور الشهري

source: Athletes List
ar: قائمة الرياضيين

source: Swim Meet Performance
ar: أداء المسابقات

source: Attendance Season
ar: حضور الموسم

source: Payments
ar: المدفوعات

source: Switch Branch
ar: تبديل الفرع

# featureComingSoon
source: {feature} feature coming soon!
ar: ميزة {feature} قادمة قريباً!

# comingSoon
source: {feature} feature coming soon!
ar: ميزة {feature} قادمة قريباً!

# comingSoonFeature
source: {feature} feature coming soon!
ar: ميزة {feature} قادمة قريباً!

# switchBranchTitle
source: Switch Branch
ar: تبديل الفرع

source: Loading branches...
ar: جارٍ تحميل الفروع...

source: No Branches Available
ar: لا توجد فروع متاحة

# noBranchesDescription
source: No branches are configured in the system.
ar: لم يتم تهيئة أي فروع في النظام.

source: Current Branch
ar: الفرع الحالي

source: Active
ar: نشط

source: Switch to Branch
ar: التبديل إلى الفرع

source: Switching...
ar: جارٍ التبديل...

source: Branch Details
ar: تفاصيل الفرع

source: Close
ar: إغلاق

source: Cancel
ar: إلغاء

# switchButton
source: Switch
ar: تبديل

source: Address
ar: العنوان

source: Phone
ar: الهاتف

source: Practice Days
ar: أيام التدريب

source: Branch ID
ar: معرف الفرع

source: Video URL
ar: رابط الفيديو

# alreadyManaging
source: You are already managing {branchName}
ar: أنت تدير بالفعل {branchName}

# switchBranchConfirm
source: Switch to {branchName}?
ar: هل تريد التبديل إلى {branchName}؟

# switchBranchDescription
source: This will update all data views to show information for {branchName}.
ar: سيؤدي هذا إلى تحديث جميع عروض البيانات لعرض معلومات {branchName}.

# switchedToBranch
source: Switched to {branchName}
ar: تم التبديل إلى {branchName}

source: Failed to load branches
ar: فشل تحميل الفروع

source: Failed to switch branch
ar: فشل تبديل الفرع

source: Refresh
ar: تحديث

# changePasswordTitle
source: Change Password
ar: تغيير كلمة المرور

source: Security Settings
ar: إعدادات الأمان

# updatePasswordPrompt
source: Update your password to keep your account secure
ar: قم بتحديث كلمة المرور الخاصة بك للحفاظ على أمان حسابك

source: Current Password
ar: كلمة المرور الحالية

# enterCurrentPassword
source: Enter your current password
ar: أدخل كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

# newPasswordHint
source: Min. 8 chars, incl. special character
ar: 8 أحرف على الأقل، تتضمن رمزًا خاصًا

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# confirmPasswordHint
source: Re-enter your new password
ar: أعد إدخال كلمة المرور الجديدة

source: Password Strength
ar: قوة كلمة المرور

# passwordTooShort
source: Too Short (Min 8 chars)
ar: قصير جدًا (8 أحرف على الأقل)

# passwordNeedsSpecialChar
source: Weak (Needs special char)
ar: ضعيف (يتطلب رمزًا خاصًا)

# passwordWeak
source: Weak
ar: ضعيف

# passwordModerate
source: Moderate
ar: متوسط

# passwordFair
source: Fair
ar: جيد

# passwordGood
source: Good
ar: جيد جدًا

# passwordStrong
source: Strong
ar: قوي

source: Password Tips
ar: نصائح كلمة المرور

# passwordTipLength
source: Use at least 8 characters
ar: استخدم 8 أحرف على الأقل

# passwordTipCase
source: Include uppercase and lowercase letters
ar: تضمين أحرف كبيرة وصغيرة

# passwordTipSpecial
source: Add numbers and special characters (e.g., !@#$)
ar: إضافة أرقام ورموز خاصة (مثل !@#$)

# passwordTipAvoid
source: Avoid common words or personal info
ar: تجنب الكلمات الشائعة أو المعلومات الشخصية

# changePasswordButton
source: Change Password
ar: تغيير كلمة المرور

# passwordChangedSuccess
source: Your password has been changed successfully. Please use your new password for future logins.
ar: تم تغيير كلمة المرور بنجاح. يرجى استخدام كلمة المرور الجديدة لتسجيل الدخول في المستقبل.

source: Success!
ar: نجاح!

source: OK
ar: موافق

# pleaseEnterCurrentPassword
source: Please enter your current password
ar: يرجى إدخال كلمة المرور الحالية

# pleaseEnterNewPassword
source: Please enter a new password
ar: يرجى إدخال كلمة المرور الجديدة

# passwordMinLength
source: Password must be at least 8 characters long
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

# passwordNeedsSpecialCharacter
source: Password must contain at least one special character
ar: يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# passwordSameAsCurrent
source: New password must be different from current password
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن الحالية

source: Failed to change password
ar: فشل في تغيير كلمة المرور

source: Change Password
ar: تغيير كلمة المرور

# coachLoginTitle
source: Coach Login
ar: تسجيل دخول المدرب

source: Team Management Portal
ar: بوابة إدارة الفريق

source: Email Address
ar: البريد الإلكتروني

# emailHint
source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Password
ar: كلمة المرور

# passwordHint
source: Enter your password
ar: أدخل كلمة المرور

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Login as Coach
ar: تسجيل دخول المدرب

source: Coach Portal
ar: بوابة المدرب

# coachPortalDescription
source: Exclusive access for coaches to manage athletes, schedules, and attendance.
ar: دخول خاص بالمدربين لإدارة اللاعبين والجداول والحضور.

# pleaseEnterEmail
source: Please enter your email
ar: يرجى إدخال البريد الإلكتروني

# invalidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# pleaseEnterPassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# passwordTooShortLogin
source: Password must be at least 6 characters
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

source: Login failed
ar: فشل تسجيل الدخول

# accessDeniedCoachOnly
source: Access denied. Coaches only.
ar: الدخول مسموح للمدربين فقط.

# networkError
source: Network error. Please try again.
ar: خطأ في الاتصال. يرجى المحاولة مرة أخرى.

# profileTitle
source: Coach Profile
ar: ملف المدرب

source: Loading profile...
ar: جارٍ تحميل الملف...

source: Error
ar: حدث خطأ

source: Retry
ar: إعادة المحاولة

source: Quick Actions
ar: إجراءات سريعة

source: Edit Profile
ar: تعديل الملف الشخصي

source: Logout
ar: تسجيل الخروج

source: Branch Attendance Summary
ar: ملخص حضور الفرع

source: Language
ar: اللغة

source: English
ar: الإنجليزية

# logoutTitle
source: Logout
ar: تسجيل الخروج

# logoutMessage
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Confirm
ar: تأكيد

source: Failed to logout
ar: فشل في تسجيل الخروج

source: Language changed to Arabic
ar: تم تغيير اللغة إلى العربية

source: Language changed to English
ar: تم تغيير اللغة إلى الإنجليزية

# branchGroupTitle
source: Branch Group
ar: دردشة الفرع

source: Loading messages...
ar: جارٍ تحميل الرسائل...

source: No messages yet
ar: لا توجد رسائل بعد

# startConversation
source: Start the conversation!
ar: ابدأ المحادثة مع أعضاء الفرع

source: An error occurred
ar: حدث خطأ ما، يرجى المحاولة مرة أخرى

# typeAMessage
source: Type your message...
ar: اكتب رسالة...

source: Online
ar: متصل

source: Unknown Branch
ar: فرع غير معروف

source: Failed to send message
ar: فشل إرسال الرسالة

# gearInformationTitle
source: Gear Information
ar: معلومات الأدوات

# editGearTitle
source: Edit Gear Information
ar: تعديل معلومات الأدوات

# gearDescription
source: This section is for the practice gear. The displayed gear is already present to the athletes. You can add whichever new gear you want to add and press update.
ar: هذا القسم مخصص لمعدات التدريب. الأدوات المعروضة متوفرة بالفعل للرياضيين. يمكنك إضافة أي معدات جديدة تريد إضافتها والضغط على تحديث.

# gearHintText
source: Enter gear requirements, equipment lists, or important notes...
ar: أدخل متطلبات الأدوات أو قوائم الأدوات أو ملاحظات مهمة...

# updateGearButton
source: Update Gear Information
ar: تحديث معلومات الأدوات

# readOnlyMessage
source: Read Only • Only Head Coaches can edit gear
ar: للقراءة فقط • يمكن للمدربين الرئيسيين فقط تعديل الأدوات

source: Loading gear information...
ar: جارٍ تحميل معلومات الأدوات...

source: Unknown error occurred
ar: حدث خطأ غير معروف

source: Updating...
ar: جارٍ التحديث...

# gearUpdateSuccess
source: Gear information updated successfully!
ar: تم تحديث معلومات الأدوات بنجاح!

# gearUpdateFailed
source: Failed to update gear
ar: فشل في تحديث الأدوات

# weeklyAttendanceTitle
source: 🏊 Weekly Attendance
ar: 🏊 الحضور الأسبوعي

source: Day 1
ar: اليوم الأول

source: Day 2
ar: اليوم الثاني

source: Day 3
ar: اليوم الثالث

source: Failed to get user profile
ar: فشل في الحصول على ملف المستخدم: {error}

# branchIdNotFound
source: Branch ID not found in user profile
ar: لم يتم العثور على معرف الفرع في ملف المستخدم

source: Failed to load user profile
ar: فشل في تحميل ملف المستخدم

# noSessionDatesConfigured
source: No session dates configured for this branch
ar: لم يتم تكوين تواريخ الجلسات لهذا الفرع

# failedToLoadSessionDates
source: Failed to load session dates: {error}
ar: فشل في تحميل تواريخ الجلسات: {error}

# failedToLoadSessionDatesGeneral
source: Failed to load session dates
ar: فشل في تحميل تواريخ الجلسات

source: Session date not available
ar: تاريخ الجلسة غير متاح

# failedToLoadAttendance
source: Failed to load attendance: {error}
ar: فشل في تحميل الحضور: {error}

# failedToLoadAttendanceGeneral
source: Failed to load attendance
ar: فشل في تحميل الحضور

# attendanceMarked
source: Attendance marked as {status}
ar: تم تسجيل الحضور كـ {status}

# failedToUpdateAttendance
source: Failed to update attendance: {error}
ar: فشل في تحديث الحضور: {error}

# failedToUpdateAttendanceGeneral
source: Failed to update attendance
ar: فشل في تحديث الحضور

source: Loading attendance...
ar: جارٍ تحميل الحضور...

source: No Athletes Found
ar: لم يتم العثور على رياضيين

# noAttendanceDataForDay
source: No attendance data for this day
ar: لا يوجد حضور لهذا اليوم

source: Unknown Athlete
ar: رياضي غير معروف

source: Missed Gear:
ar: الأدوات الناقصة:

# status
source: Status: {status}
ar: الحالة: {status}

# didMissGear
source: Did the athlete miss any gear at practice?
ar: هل فقد الرياضي أي معدات في التدريب؟

source: Yes
ar: نعم

source: No
ar: لا

source: Type missed gear here...
ar: اكتب الأدوات المفقودة هنا...

source: Submit
ar: إرسال

# enterMissedGearNotes
source: Please enter missed gear notes
ar: يرجى إدخال ملاحظات الأدوات المفقودة

source: Loading requests...
ar: جارٍ تحميل الطلبات...

source: No Pending Requests
ar: لا توجد طلبات معلقة

# allRequestsProcessed
source: All registration requests have been processed
ar: تم معالجة جميع طلبات التسجيل

source: Pending Requests
ar: الطلبات المعلقة

# athletesWaitingApproval
source: {count} athlete(s) waiting for approval
ar: {count} رياضي في انتظار الموافقة

# failedToLoadRequests
source: Failed to load registration requests: {error}
ar: فشل في تحميل طلبات التسجيل: {error}

# failedToLoadRequestsGeneral
source: Failed to load registration requests
ar: فشل في تحميل طلبات التسجيل

source: Approve Registration
ar: الموافقة على التسجيل

# approveRegistrationMessage
source: Are you sure you want to approve {athlete}'s registration request?
ar: هل أنت متأكد من أنك تريد الموافقة على طلب تسجيل {athlete}؟

source: Approve
ar: الموافقة

# registrationApproved
source: Registration approved successfully!
ar: تم قبول التسجيل بنجاح!

# failedToApproveRegistration
source: Failed to approve registration: {error}
ar: فشل في الموافقة على التسجيل: {error}

# failedToApproveRegistrationGeneral
source: Failed to approve registration
ar: فشل في الموافقة على التسجيل

source: Reject Registration
ar: رفض التسجيل

# rejectRegistrationMessage
source: Are you sure you want to reject {athlete}'s registration request? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد رفض طلب تسجيل {athlete}؟ لا يمكن التراجع عن هذا الإجراء.

source: Reject
ar: رفض

# registrationRejected
source: Registration request rejected
ar: تم رفض طلب التسجيل

# failedToRejectRegistration
source: Failed to reject registration: {error}
ar: فشل في رفض التسجيل: {error}

# failedToRejectRegistrationGeneral
source: Failed to reject registration
ar: فشل في رفض التسجيل

source: Pending
ar: قيد الانتظار

source: Processing...
ar: جارٍ المعالجة...

source: Unknown
ar: غير معروف

source: Invalid date
ar: تاريخ غير صالح

# submitted
source: Submitted {date}
ar: تم الإرسال {date}

source: No email
ar: لا يوجد بريد إلكتروني

source: No phone
ar: لا يوجد هاتف

source: Monthly Attendance
ar: الحضور الشهري

source: Loading athletes...
ar: جاري تحميل الرياضيين...

source: Error Loading Athletes
ar: حدث خطأ أثناء تحميل الرياضيين

# noAthletesRegistered
source: No athletes are registered in the academy
ar: لا يوجد رياضيون مسجلون في الأكاديمية

source: Monthly Attendance Overview
ar: نظرة عامة على الحضور الشهري

# athletesInBranch
source: {count, plural, =1 {1 athlete in branch} other {{count} athletes in branch}}
ar: {count, plural, =1 {رياضي واحد في الفرع} other {{count} رياضيين في الفرع}}

source: Search athletes...
ar: ابحث عن الرياضيين...

# failedToLoadAthletes
source: Failed to load athletes: {error}
ar: فشل في تحميل الرياضيين: {error}

# failedToLoadAthletesGeneral
source: Failed to load athletes
ar: فشل في تحميل الرياضيين

source: Athletes Management
ar: إدارة الرياضيين

# athleteId
source: ID: {id}
ar: المعرف: {id}

source: Delete Athlete
ar: حذف الرياضي

# deleteAthleteConfirm
source: Are you sure you want to permanently delete {name}?
ar: هل أنت متأكد أنك تريد حذف {name} نهائيًا؟

# deleteAthleteWarning
source: ⚠️ This action cannot be undone!
ar: ⚠️ لا يمكن التراجع عن هذا الإجراء!

# deleteAthleteDetails
source: • The athlete will lose access to their account forever • All their data will be permanently removed • This action is irreversible
ar: • سيفقد الرياضي حق الدخول لحسابه نهائيًا • سيتم حذف جميع بياناته نهائياً • هذا الإجراء غير قابل للاسترجاع

# delete
source: Delete Forever
ar: حذف للأبد

# deleteAthleteSuccess
source: {name} has been permanently deleted
ar: تم حذف {name} نهائيًا

# deleteAthleteFailed
source: Failed to delete athlete: {error}
ar: فشل في حذف الرياضي: {error}

# athletesInAcademy
source: {count, plural, =1 {1 athlete in academy} other {{count} athletes in academy}}
ar: {count, plural, =1 {رياضي واحد في الأكاديمية} other {{count} رياضيين في الأكاديمية}}

# invalidId
source: Invalid athlete ID
ar: معرف رياضي غير صالح

source: Athlete
ar: رياضي

# presentWithGear
source: Present + Gear
ar: حضور + معدات كاملة

# presentWithoutGear
source: Present - Gear
ar: حضور - نقص معدات

source: Absent
ar: غياب

source: Monthly Statistics
ar: إحصائيات الشهر

source: Attendance Rate
ar: معدل الحضور

source: Days Present
ar: أيام الحضور

source: Days Absent
ar: أيام الغياب

source: Gear Issues
ar: ملاحظات الأدوات

source: Missed Gear Details
ar: تفاصيل الأدوات الناقصة

# perfectNoGearMissed
source: Perfect! No gear was missed this month.
ar: رائع! لم يتم نسيان أي معدات هذا الشهر.

source: Notes:
ar: ملاحظات:

# daysOfWeek
source: Sun,Mon,Tue,Wed,Thu,Fri,Sat
ar: الأحد,الاثنين,الثلاثاء,الأربعاء,الخميس,الجمعة,السبت

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

source: Performance Logs
ar: سجلات الأداء

source: Athlete Performance Logs
ar: سجلات أداء الرياضيين

# noAthletesRegisteredBranch
source: No athletes are registered in this branch
ar: لا يوجد رياضيين مسجلين في هذا الفرع

source: View Times
ar: عرض الأوقات

# idField
source: ID: {id}
ar: المعرف: {id}

source: Loading performance logs...
ar: جاري تحميل سجلات الأداء...

source: Error Loading Performance Logs
ar: حدث خطأ أثناء تحميل سجلات الأداء

source: No Performance Logs
ar: لا يوجد سجلات أداء

# noPerformanceRecords
source: No performance records found for this athlete
ar: لا توجد سجلات أداء لهذا الرياضي

source: Performance
ar: الأداء

# performanceRecord
source: {count, plural, =1 {1 performance record} other {{count} performance records}}
ar: {count, plural, =1 {سجل أداء واحد} other {{count} سجلات أداء}}

source: Unknown Event
ar: حدث غير معروف

source: No time
ar: لا يوجد وقت

source: Training Session
ar: حصة تدريبية

source: Payment Management
ar: إدارة المدفوعات

source: Loading payment data...
ar: جاري تحميل بيانات المدفوعات...

source: Error Loading Payment Data
ar: حدث خطأ أثناء تحميل بيانات المدفوعات

source: Monthly Payment Status
ar: حالة الدفع الشهرية

source: Paid
ar: تم الدفع

source: Late
ar: متأخر

source: Current:
ar: الحالي:

# paymentStatusUpdated
source: Payment status updated successfully
ar: تم تحديث حالة الدفع بنجاح

# failedToUpdatePaymentStatus
source: Failed to update payment status: {error}
ar: فشل في تحديث حالة الدفع: {error}

source: Athletes Measurements
ar: قياسات الرياضيين

source: Measurements
ar: القياسات

source: Loading measurements...
ar: جاري تحميل القياسات...

source: Error Loading Measurements
ar: حدث خطأ أثناء تحميل القياسات

source: No Measurements
ar: لا توجد قياسات

# noMeasurementsForAthlete
source: No measurements found for this athlete
ar: لم يتم العثور على قياسات لهذا الرياضي

source: No data available
ar: لا توجد بيانات متاحة

source: measurement record
ar: تسجيل قياس

source: measurement records
ar: تسجيلات قياس

source: Height
ar: الطول

source: Weight
ar: الوزن

source: Arm
ar: الذراع

source: Leg
ar: الساق

source: Fat %
ar: نسبة الدهون

source: Muscle %
ar: نسبة العضلات

source: Not recorded
ar: غير مسجل

source: Sign In
ar: تسجيل الدخول

# signInToAccount
source: Sign in to your account
ar: سجل دخولك إلى حسابك

source: Email
ar: البريد الإلكتروني

# enterEmail
source: Please enter your email
ar: يرجى إدخال البريد الإلكتروني

# validEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# enterPassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# signInBtn
source: Sign In
ar: تسجيل الدخول

# dontHaveAccount
source: Don't have an account? Sign Up
ar: ليس لديك حساب؟ سجل الآن

# unknownUserType
source: Unknown user type: {userType}
ar: نوع المستخدم غير معروف: {userType}

source: Branch Discussion
ar: مناقشة الفرع

source: No Chat Threads Yet
ar: لا توجد مواضيع دردشة بعد

source: Create Thread
ar: إنشاء موضوع

source: Create New Thread
ar: إنشاء موضوع جديد

source: Thread title cannot be empty!
ar: لا يمكن أن يكون عنوان الموضوع فارغًا

# readOnlyMode
source: You are viewing this chat in read-only mode.
ar: تشاهد هذه الدردشة بوضع القراءة فقط.

source: Today at
ar: اليوم في {time}

source: Yesterday at
ar: أمس في {time}

source: Coach Branch Assignment
ar: تخصيص فروع المدربين

# assignCoachesTitle
source: Assign Coaches
ar: تعيين المدربين

# refreshTooltip
source: Refresh
ar: تحديث

source: Loading coaches...
ar: جارٍ تحميل المدربين...

source: No Coaches Found
ar: لم يتم العثور على مدربين

# noCoachesAvailable
source: No coaches are available for assignment
ar: لا يوجد مدربون متاحون للتعيين

# coachAssignmentsTitle
source: Coach Assignments
ar: تعيينات المدربين

# coachesInSystem
source: {count, plural, =1 {{count} coach in the system} other {{count} coaches in the system}}
ar: {count, plural, =1 {مدرب واحد في النظام} other {{count} مدربين في النظام}}

# searchCoachesHint
source: Search coaches...
ar: البحث عن المدربين...

# assignedStat
source: Assigned
ar: معين

# unassignedStat
source: Unassigned
ar: غير معين

# multiBranchStat
source: Multi-Branch
ar: فروع متعددة

# noCoachesForQuery
source: No coaches found for "{query}"
ar: لم يتم العثور على مدربين لـ "{query}"

# failedToLoadCoaches
source: Failed to load coaches: {error}
ar: فشل تحميل المدربين: {error}

# failedToLoadStats
source: Failed to load assignment stats: {error}
ar: فشل تحميل إحصائيات التعيين: {error}

source: Failed to load data
ar: فشل تحميل البيانات

# branchesAssignedTo
source: Branches assigned to {coachName}
ar: الفروع المعينة لـ {coachName}

source: No branches found
ar: لم يتم العثور على فروع

# assignButton
source: Assign
ar: تعيين

# unassignButton
source: Unassign
ar: إلغاء التعيين

# backButton
source: Back
ar: رجوع

source: Error loading branches
ar: خطأ في تحميل الفروع

source: Failed to assign
ar: فشل التعيين

source: Failed to unassign
ar: فشل إلغاء التعيين

source: Branch assigned
ar: تم تعيين الفرع

source: Branch unassigned
ar: تم إلغاء تعيين الفرع
